In [14]:
import pandas as pd

data = {
    "id": [1,2,3],
    "salary": [100,200,300]
}

employee = pd.DataFrame(data)

employee

   id  salary
0   1     100
1   2     200
2   3     300

In [15]:
employee_ordered = employee.sort_values("salary", ascending=False).reset_index(drop=True)

employee_ordered

   id  salary
0   3     300
1   2     200
2   1     100

In [16]:
employee_ordered.shape

(3, 2)

In [17]:
if employee_ordered.shape[0] == 1:
    employee_ordered = pd.concat([employee_ordered, pd.DataFrame({"id": [2], "salary": [None]})])
    employee_ordered = employee_ordered.reset_index(drop=True)

employee_ordered

   id  salary
0   3     300
1   2     200
2   1     100

In [18]:
employee_ordered.loc[[1]]

   id  salary
1   2     200

In [19]:
employee = employee.drop_duplicates(subset=["salary"])

employee

   id  salary
0   1     100
1   2     200
2   3     300

In [21]:
def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:

    employee = employee.drop_duplicates(subset=["salary"])

    employee_ordered = employee.sort_values("salary", ascending=False).reset_index(drop=True)

    if (employee_ordered.shape[0] < N) or (N <= 0):
        return pd.DataFrame({f"getNthHighestSalary({N})": [None]})

    employee_ordered = employee_ordered.rename(columns={"salary": f"getNthHighestSalary({N})"})

    return employee_ordered.iloc[[N-1], [1]]

nth_highest_salary(employee, 2)

   getNthHighestSalary(2)
1                     200